//Упражнение 1.3.Напишите программу, которая выводит на стандартное
//устройство вывода фразу "Hello, World".

#include <iostream>

int main() {
	std::cout << "Hello, World" << std::endl;
	return 0;
}